session3/exercice/jdbc-checklist.org
#+TITLE: Checklist pour auto-évaluation du mini projet JDBC
#+DATE: 
#+AUTHOR: 
#+OPTIONS: ^:nil toc:2
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}

#+latex_header: \usepackage{libertine}
#+latex_header: \usepackage{unicode-math}
#+LATEX_HEADER: \setmainfont{XITS}
#+LATEX_HEADER: \setmathfont{XITS Math}
#+LATEX_HEADER: \setmathfont[range={\mathcal,\mathbfcal},StylisticSet=1]{XITS Math}

#+LaTeX_HEADER: \addtolength{\oddsidemargin}{-.875in}
#+LaTeX_HEADER:	\addtolength{\evensidemargin}{-.875in}
#+LaTeX_HEADER:	\addtolength{\textwidth}{1.75in}
#+LaTeX_HEADER:
#+LaTeX_HEADER:	\addtolength{\topmargin}{-1.875in}
#+LaTeX_HEADER:	\addtolength{\textheight}{2.75in}
#+LaTeX_HEADER: \usepackage{comment}

#+BEGIN_SRC elisp :exports none :results silent
(org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t))) 
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)

(setq org-latex-inputenc-alist '(("utf8" . "utf8x")))
(setq org-latex-pdf-process
      '("lualatex -shell-escape -interaction nonstopmode %f"
        "lualatex -shell-escape -interaction nonstopmode %f")) 
  (setq org-latex-minted-options '(("frame" "lines")
                                   ("fontsize" "\\scriptsize")
                                   ("xleftmargin" "\\parindent")
                                   ("linenos" "")))
;; lualatex preview
(setq org-latex-pdf-process
  '("lualatex -shell-escape -interaction nonstopmode %f"
    "lualatex -shell-escape -interaction nonstopmode %f")) 

(setq luamagick '(luamagick :programs ("lualatex" "convert")
       :description "pdf > png"
       :message "you need to install lualatex and imagemagick."
       :use-xcolor t
       :image-input-type "pdf"
       :image-output-type "png"
       :image-size-adjust (1.0 . 1.0)
       :latex-compiler ("lualatex -interaction nonstopmode -output-directory %o %f")
       :image-converter ("convert -density %D -trim -antialias %f -quality 100 %O")))

(add-to-list 'org-preview-latex-process-alist luamagick)

(setq org-preview-latex-default-process 'luamagick)
(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)

#+END_SRC


* Manuels
** Manuel de déploiement
Il faut rendre accessible sur/à partir du poste :
- le programme
- la/une base de données

*** Déploiement du programme
Comment l'application sera-t'elle utilisée ?
- À partir d'Eclipse :: Dans ce cas, le 'déploiement' sera la recopie
     du répertoire contenant le projet, et son 'import' sous Eclipse ☹.
- En utilisant les classes compilées et éventuel fichier .properties :: Dans ce cas, on doit recopier
     les fichiers '.class' et la structure de répertoires /
     sous-répertoires correspondant aux /packages/.
- En utilisant un fichier .jar :: il suffit de recopier le fichier
     .jar.

Dans les deux derniers cas, comme les fichiers /.class/ et /.jar/ ne
sont pas versionnés sous git, il faut les mettre à disposition. Par
exemple dans le cadre d'une [[https://blog.github.com/2013-07-02-release-your-software/][release github]]. Le manuel de déploiement
doit alors indiquer quelles sont les versions (minimum) requises.

Il faut aussi penser aux dépendances, par exemple la bibliothèque de
pilote JDBC pour Postgresql. Dans le cas d'une distribution de sources
(utilisation d'Eclipse), =maven= prendra en charge le téléchargement
automatiquement. Dans le cas de l'utilisation des fichiers .class
compilés, il faudra que le fichier .jar du pilote soit dans le
[[https://en.wikipedia.org/wiki/Classpath_(Java)][CLASSPATH]]. Dans le cas d'un fichier .jar, il faudra choisir si l'on
laisse (oblige à) utiliser un driver dans le /CLASSPATH/ (comme
précédemment), ou si l'on produit un /fat jar/ (ou /uber jar/) (par
exemple [[https://dzone.com/articles/creating-executable-uber-jar%25E2%2580%2599s][avec maven]]).

*** Déploiement de la base
Deux cas de figure :
- le programme utilise une base déjà existante et accessible (par
  exemple [[http://elephantsql.com/][hébergée]]. Le manuel de déploiement doit alors indiquer ses
  caractéristiques (URL, login, pass, ports utilisés).
- le programme utilise une base spécifiquement crée. Le manuel de
  déploiement indique quel SGBDR est nécessaire et fourni les script
  SQL éventuellement nécessaire pour initialiser la base de données
  (une autre possibilité est que l'initialisation soit réalisée par le
  programme lui-même).

** Manuel d'utilisation
*** Lancement du programme
Le manuel indique comment lancer le programme (cf. supra options de
déploiement) et éventuellement comment paramétrer l'exécution (fichier
/.properties/, variables d'environnement, arguments) par exemple pour
l'adresse de la base et les login / mot de passe pour y accéder).
*** Exécution
Le manuel indique comment interagir avec le programmes (écrans…).


** Manuel de développement

*** Base de données
Suivant que la conception de la base de données a fait ou non partie
du développement, le manuel indique les différents modèles (logique,
conceptuel, physique, implémentation) selon leur pertinence (si le
modèle est complexe, on aura besoin des modèles les plus abstraits
pour ne pas être embrouillé par les détails des modèles plus
concrets).

Les types de données et les contraintes sont justifiées, ainsi que les
conventions de nommage (référence à la norme suivie).

