session3/exercice/jdbc-checklist.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-12-04 Wed 01:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Checklist pour auto-évaluation du mini projet JDBC</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Checklist pour auto-évaluation du mini projet JDBC</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5ca9314">1. Manuels</a>
<ul>
<li><a href="#org672bbeb">1.1. Manuel de déploiement</a></li>
<li><a href="#orgf37892e">1.2. Manuel d'utilisation</a></li>
<li><a href="#orgaf86fed">1.3. Manuel de développement</a></li>
</ul>
</li>
<li><a href="#org8b2fcd6">2. Code</a>
<ul>
<li><a href="#org6cb4430">2.1. Architecture</a></li>
<li><a href="#org3f6c69c">2.2. Durées de vie et portées</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5ca9314" class="outline-2">
<h2 id="org5ca9314"><span class="section-number-2">1</span> Manuels</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org672bbeb" class="outline-3">
<h3 id="org672bbeb"><span class="section-number-3">1.1</span> Manuel de déploiement</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Il faut rendre accessible sur/à partir du poste :
</p>
<ul class="org-ul">
<li>le programme</li>
<li>la/une base de données</li>
</ul>
</div>

<div id="outline-container-org234955a" class="outline-4">
<h4 id="org234955a"><span class="section-number-4">1.1.1</span> Déploiement du programme</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Comment l'application sera-t'elle utilisée ?
</p>
<dl class="org-dl">
<dt>À partir d'Eclipse</dt><dd>Dans ce cas, le 'déploiement' sera la recopie
du répertoire contenant le projet, et son 'import' sous Eclipse ☹.</dd>
<dt>En utilisant les classes compilées et éventuel fichier .properties</dt><dd>Dans ce cas, on doit recopier
les fichiers '.class' et la structure de répertoires /
sous-répertoires correspondant aux <i>packages</i>.</dd>
<dt>En utilisant un fichier .jar</dt><dd>il suffit de recopier le fichier
.jar.</dd>
</dl>

<p>
Dans les deux derniers cas, comme les fichiers <i>.class</i> et <i>.jar</i> ne
sont pas versionnés sous git, il faut les mettre à disposition. Par
exemple dans le cadre d'une <a href="https://blog.github.com/2013-07-02-release-your-software/">release github</a>. Le manuel de déploiement
doit alors indiquer quelles sont les versions (minimum) requises.
</p>

<p>
Il faut aussi penser aux dépendances, par exemple la bibliothèque de
pilote JDBC pour Postgresql. Dans le cas d'une distribution de sources
(utilisation d'Eclipse), <code>maven</code> prendra en charge le téléchargement
automatiquement. Dans le cas de l'utilisation des fichiers .class
compilés, il faudra que le fichier .jar du pilote soit dans le
<a href="https://en.wikipedia.org/wiki/Classpath_(Java)">CLASSPATH</a>. Dans le cas d'un fichier .jar, il faudra choisir si l'on
laisse (oblige à) utiliser un driver dans le <i>CLASSPATH</i> (comme
précédemment), ou si l'on produit un <i>fat jar</i> (ou <i>uber jar</i>) (par
exemple <a href="https://dzone.com/articles/creating-executable-uber-jar%E2%80%99s">avec maven</a>).
</p>
</div>
</div>

<div id="outline-container-orgf3f4f3b" class="outline-4">
<h4 id="orgf3f4f3b"><span class="section-number-4">1.1.2</span> Déploiement de la base</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Deux cas de figure :
</p>
<ul class="org-ul">
<li>le programme utilise une base déjà existante et accessible (par
exemple <a href="http://elephantsql.com/">hébergée</a>. Le manuel de déploiement doit alors indiquer ses
caractéristiques (URL, login, pass, ports utilisés).</li>
<li>le programme utilise une base spécifiquement crée. Le manuel de
déploiement indique quel SGBDR est nécessaire et fourni les script
SQL éventuellement nécessaire pour initialiser la base de données
(une autre possibilité est que l'initialisation soit réalisée par le
programme lui-même).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf37892e" class="outline-3">
<h3 id="orgf37892e"><span class="section-number-3">1.2</span> Manuel d'utilisation</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org33c350b" class="outline-4">
<h4 id="org33c350b"><span class="section-number-4">1.2.1</span> Lancement du programme</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Le manuel indique comment lancer le programme (cf. supra options de
déploiement) et éventuellement comment paramétrer l'exécution (fichier
<i>.properties</i>, variables d'environnement, arguments) par exemple pour
l'adresse de la base et les login / mot de passe pour y accéder).
</p>
</div>
</div>
<div id="outline-container-org484dac5" class="outline-4">
<h4 id="org484dac5"><span class="section-number-4">1.2.2</span> Exécution</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Le manuel indique comment interagir avec le programmes (écrans…).
</p>
</div>
</div>
</div>


<div id="outline-container-orgaf86fed" class="outline-3">
<h3 id="orgaf86fed"><span class="section-number-3">1.3</span> Manuel de développement</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org7e713b7" class="outline-4">
<h4 id="org7e713b7"><span class="section-number-4">1.3.1</span> Base de données</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Suivant que la conception de la base de données a fait ou non partie
du développement, le manuel indique les différents modèles (logique,
conceptuel, physique, implémentation) selon leur pertinence (si le
modèle est complexe, on aura besoin des modèles les plus abstraits
pour ne pas être embrouillé par les détails des modèles plus
concrets).
</p>

<p>
Les types de données et les contraintes sont justifiées, ainsi que les
conventions de nommage (référence à la norme suivie).
</p>
</div>
</div>
