session3/exercice/jdbc-checklist.md
- [Manuels](#orgc5af08d)
  - [Manuel de déploiement](#org2b6e584)
  - [Manuel d'utilisation](#org16d4fe6)
  - [Manuel de développement](#org80265c3)
- [Code](#org5a538f3)
  - [Architecture](#org878e228)
  - [Durées de vie et portées](#orge1d9127)



<a id="orgc5af08d"></a>

# Manuels


<a id="org2b6e584"></a>

## Manuel de déploiement

Il faut rendre accessible sur/à partir du poste :

-   le programme
-   la/une base de données


### Déploiement du programme

Comment l'application sera-t'elle utilisée ?

-   **À partir d'Eclipse:** Dans ce cas, le 'déploiement' sera la recopie du répertoire contenant le projet, et son 'import' sous Eclipse ☹.
-   **En utilisant les classes compilées et éventuel fichier .properties:** Dans ce cas, on doit recopier les fichiers '.class' et la structure de répertoires / sous-répertoires correspondant aux *packages*.
-   **En utilisant un fichier .jar:** il suffit de recopier le fichier .jar.

Dans les deux derniers cas, comme les fichiers *.class* et *.jar* ne sont pas versionnés sous git, il faut les mettre à disposition. Par exemple dans le cadre d'une [release github](https://blog.github.com/2013-07-02-release-your-software/). Le manuel de déploiement doit alors indiquer quelles sont les versions (minimum) requises.

Il faut aussi penser aux dépendances, par exemple la bibliothèque de pilote JDBC pour Postgresql. Dans le cas d'une distribution de sources (utilisation d'Eclipse), `maven` prendra en charge le téléchargement automatiquement. Dans le cas de l'utilisation des fichiers .class compilés, il faudra que le fichier .jar du pilote soit dans le [CLASSPATH](https://en.wikipedia.org/wiki/Classpath_(Java)). Dans le cas d'un fichier .jar, il faudra choisir si l'on laisse (oblige à) utiliser un driver dans le *CLASSPATH* (comme précédemment), ou si l'on produit un *fat jar* (ou *uber jar*) (par exemple [avec maven](https://dzone.com/articles/creating-executable-uber-jar%E2%80%99s)).


### Déploiement de la base

Deux cas de figure :

-   le programme utilise une base déjà existante et accessible (par exemple [hébergée](http://elephantsql.com/). Le manuel de déploiement doit alors indiquer ses caractéristiques (URL, login, pass, ports utilisés).
-   le programme utilise une base spécifiquement crée. Le manuel de déploiement indique quel SGBDR est nécessaire et fourni les script SQL éventuellement nécessaire pour initialiser la base de données (une autre possibilité est que l'initialisation soit réalisée par le programme lui-même).


<a id="org16d4fe6"></a>

## Manuel d'utilisation


### Lancement du programme

Le manuel indique comment lancer le programme (cf. supra options de déploiement) et éventuellement comment paramétrer l'exécution (fichier *.properties*, variables d'environnement, arguments) par exemple pour l'adresse de la base et les login / mot de passe pour y accéder).


### Exécution

Le manuel indique comment interagir avec le programmes (écrans…).


<a id="org80265c3"></a>

## Manuel de développement


### Base de données

Suivant que la conception de la base de données a fait ou non partie du développement, le manuel indique les différents modèles (logique, conceptuel, physique, implémentation) selon leur pertinence (si le modèle est complexe, on aura besoin des modèles les plus abstraits pour ne pas être embrouillé par les détails des modèles plus concrets).

Les types de données et les contraintes sont justifiées, ainsi que les conventions de nommage (référence à la norme suivie).
