session3/exercice/jdbc-checklist.org
*** Code
Les éventuels packages et les classes sont présentées, notamment avec
un ou plusieurs diagrammes de classe (UML).

Si possible, une documentation est générée avec [[http://www.oracle.com/technetwork/articles/java/index-137868.html][Javadoc]].


Si possible, les tests (et comment les lancer) sont expliqués.

La façon de générer le programme (par exemple un /.jar/,
cf. déploiement) est expliquée.

* Code

** Architecture

Comment décomposer son code en classes ? L'objectif de la décomposition
est principalement d'isoler en composants plus ou moins autonomes ce
qui peut l'être, afin de limiter l'étendue de ce qui sera concerné par
une éventuelle lors de la maintenance du code.  Bien sûr, l'exercice
est tellement limité qu'il n'y a pas vraiment d'enjeu et il faut faire
preuve d'imagination pour mettre en œuvre ce qui ne sera nécessaire
que pour un 'vrai' projet.

On peut par exemple isoler :
- chacune des /entités/ (membre d'un club de sport, article
  vestimentaire, client, ce qui est vendu,…) qui sont représentées
  dans la base (tables et lignes de ces tables) et manipulées par le
  programme (classes et objets instances de ces classes, dont les
  attributs correspondent aux colonnes).
- Pour chacune de ces entités, ce qui permet d'interagir avec la table
  correspondante ([[http://www.oracle.com/technetwork/java/dataaccessobject-138824.html][Data Access Object]]).
- le code qui manipule les entités pour réaliser les opérations
  voulues.
- le code qui permet à l'utilisateur d'interagir avec le programme
  (/User Interface/).


Ainsi, toute modification de l'/implémentation/ de l'une de ces
classes n'aura pas d'impact sur le reste du code.

*** Classes 'entités'

**** Attributs
Ces classes contiennent les attributs qui correspondent aux colonnes
de la table correspondante. Il faut choisir les types correspondants,
en se posant la question de la possibilité ou non de valeurs
manquantes (=NULLABLE=). Si une valeur peut être manquante (=NULL=),
on la représentera par un objet, ou plus exactement une référence qui
pourra être nulle. On aura un attribut =id= correspondant à la clé
primaire.

**** Constructeurs
On voudra faire un constructeur 'classique' qui prendra autant
d'argument que la classe a d'attributs d'instance et les initialisera
tous. Ce constructeur permettra de créer des objets lus dans la table.
Mais pour créer de nouveaux objets, par exemple à partir de valeurs
saisie par l'utilisateur/trice, on ne disposera pas de la valeur de
l'identifiant. En effet, cette valeur (dans le cas qui nous intéresse
d'une clé primaire de type =SERIAL=) est générée par la base de
données lors de l'insertion. On aura donc un autre constructeur qui
construira des objets au laissant l'identifiant en valeur manquante,
avant l'insertion dans la base. Cette insertion devra mettre à jour la
valeur de l'identifiant.


** Durées de vie et portées

*** Appels à .close

Tous les objets qui doivent être 'fermés' par un appel à une méthode
=.close()= doivent être initialisés dans un [[https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html][try with resources]] (ce qui
impose une version de java supérieure ou égale à =1.7=, cf §
déploiement) ou défaut avoir un appel à =.close()= dans un bloc
=finally=.  Ce la concerne aussi bien les objets manipulés à travers
l'interface [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html][java.sql.Connection]] que les [[https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html][java.sql.Statement]] ou (mieux
!) [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html][java.sql.PreparedStatement]].

*** Statement vs PreparedStatement

Pour éviter les [[https://xkcd.com/327/][risques]] d'[[https://www.explainxkcd.com/wiki/index.php/Little_Bobby_Tables][injection SQL]], on ne construira *JAMAIS* de
requêtes SQL à partir de chaînes de caractères saisies par
l'utilisateur/trice ! On utilisera [[https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html][java.sql.PreparedStatement]] récupéré
par un appel à [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)][prepareStatement]].


