session3/exercice/jdbc-checklist.html

<div id="outline-container-orge06dd78" class="outline-4">
<h4 id="orge06dd78"><span class="section-number-4">1.3.2</span> Code</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Les éventuels packages et les classes sont présentées, notamment avec
un ou plusieurs diagrammes de classe (UML).
</p>

<p>
Si possible, une documentation est générée avec <a href="http://www.oracle.com/technetwork/articles/java/index-137868.html">Javadoc</a>.
</p>


<p>
Si possible, les tests (et comment les lancer) sont expliqués.
</p>

<p>
La façon de générer le programme (par exemple un <i>.jar</i>,
cf. déploiement) est expliquée.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org8b2fcd6" class="outline-2">
<h2 id="org8b2fcd6"><span class="section-number-2">2</span> Code</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6cb4430" class="outline-3">
<h3 id="org6cb4430"><span class="section-number-3">2.1</span> Architecture</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Comment décomposer son code en classes ? L'objectif de la décomposition
est principalement d'isoler en composants plus ou moins autonomes ce
qui peut l'être, afin de limiter l'étendue de ce qui sera concerné par
une éventuelle lors de la maintenance du code.  Bien sûr, l'exercice
est tellement limité qu'il n'y a pas vraiment d'enjeu et il faut faire
preuve d'imagination pour mettre en œuvre ce qui ne sera nécessaire
que pour un 'vrai' projet.
</p>

<p>
On peut par exemple isoler :
</p>
<ul class="org-ul">
<li>chacune des <i>entités</i> (membre d'un club de sport, article
vestimentaire, client, ce qui est vendu,…) qui sont représentées
dans la base (tables et lignes de ces tables) et manipulées par le
programme (classes et objets instances de ces classes, dont les
attributs correspondent aux colonnes).</li>
<li>Pour chacune de ces entités, ce qui permet d'interagir avec la table
correspondante (<a href="http://www.oracle.com/technetwork/java/dataaccessobject-138824.html">Data Access Object</a>).</li>
<li>le code qui manipule les entités pour réaliser les opérations
voulues.</li>
<li>le code qui permet à l'utilisateur d'interagir avec le programme
(<i>User Interface</i>).</li>
</ul>


<p>
Ainsi, toute modification de l'<i>implémentation</i> de l'une de ces
classes n'aura pas d'impact sur le reste du code.
</p>
</div>

<div id="outline-container-orgdba264d" class="outline-4">
<h4 id="orgdba264d"><span class="section-number-4">2.1.1</span> Classes 'entités'</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgd391900"></a>Attributs<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Ces classes contiennent les attributs qui correspondent aux colonnes
de la table correspondante. Il faut choisir les types correspondants,
en se posant la question de la possibilité ou non de valeurs
manquantes (<code>NULLABLE</code>). Si une valeur peut être manquante (<code>NULL</code>),
on la représentera par un objet, ou plus exactement une référence qui
pourra être nulle. On aura un attribut <code>id</code> correspondant à la clé
primaire.
</p>
</div>
</li>

<li><a id="orga238939"></a>Constructeurs<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
On voudra faire un constructeur 'classique' qui prendra autant
d'argument que la classe a d'attributs d'instance et les initialisera
tous. Ce constructeur permettra de créer des objets lus dans la table.
Mais pour créer de nouveaux objets, par exemple à partir de valeurs
saisie par l'utilisateur/trice, on ne disposera pas de la valeur de
l'identifiant. En effet, cette valeur (dans le cas qui nous intéresse
d'une clé primaire de type <code>SERIAL</code>) est générée par la base de
données lors de l'insertion. On aura donc un autre constructeur qui
construira des objets au laissant l'identifiant en valeur manquante,
avant l'insertion dans la base. Cette insertion devra mettre à jour la
valeur de l'identifiant.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org3f6c69c" class="outline-3">
<h3 id="org3f6c69c"><span class="section-number-3">2.2</span> Durées de vie et portées</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org2c7ed2d" class="outline-4">
<h4 id="org2c7ed2d"><span class="section-number-4">2.2.1</span> Appels à .close</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Tous les objets qui doivent être 'fermés' par un appel à une méthode
<code>.close()</code> doivent être initialisés dans un <a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/tryResourceClose.html">try with resources</a> (ce qui
impose une version de java supérieure ou égale à <code>1.7</code>, cf §
déploiement) ou défaut avoir un appel à <code>.close()</code> dans un bloc
<code>finally</code>.  Ce la concerne aussi bien les objets manipulés à travers
l'interface <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a> que les <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Statement.html">java.sql.Statement</a> ou (mieux
!) <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html">java.sql.PreparedStatement</a>.
</p>
</div>
</div>

<div id="outline-container-org14a87d0" class="outline-4">
<h4 id="org14a87d0"><span class="section-number-4">2.2.2</span> Statement vs PreparedStatement</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Pour éviter les <a href="https://xkcd.com/327/">risques</a> d'<a href="https://www.explainxkcd.com/wiki/index.php/Little_Bobby_Tables">injection SQL</a>, on ne construira <b>JAMAIS</b> de
requêtes SQL à partir de chaînes de caractères saisies par
l'utilisateur/trice ! On utilisera <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/PreparedStatement.html">java.sql.PreparedStatement</a> récupéré
par un appel à <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html#prepareStatement(java.lang.String)">prepareStatement</a>.
</p>
</div>
</div>
