session3/exercice/jdbc-checklist.org
*** Objet [[https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html][java.sql.Connection]]

Se pose le problème de la durée de vie de la connexion, et comment
elle est partagée ou non et avec quelle portée.

Au minimum, une seule connexion doit être utilisée pour toutes les
opérations SQL au sein d'une même /transaction/.

Au maximum, on sera tenté de réutiliser le même objet connexion dans
tout le programme. Cependant, c'est sans doute une mauvaise idée dans
le cas d'un programme qui peut tourner un temps indéterminé en
attendant des entrées : le serveur de base de données prendra lui-même
l'initiative de fermer la connexion au bout d'un certain temps si
celle-ci est inactive (/idle/) !

Il est plus sûr de recréer une connexion à chaque fois que le
programme traite une demande.



