session3/exercice/jdbc-checklist.html


<div id="outline-container-orgf258ae4" class="outline-4">
<h4 id="orgf258ae4"><span class="section-number-4">2.2.3</span> Objet <a href="https://docs.oracle.com/javase/7/docs/api/java/sql/Connection.html">java.sql.Connection</a></h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Se pose le problème de la durée de vie de la connexion, et comment
elle est partagée ou non et avec quelle portée.
</p>

<p>
Au minimum, une seule connexion doit être utilisée pour toutes les
opérations SQL au sein d'une même <i>transaction</i>.
</p>

<p>
Au maximum, on sera tenté de réutiliser le même objet connexion dans
tout le programme. Cependant, c'est sans doute une mauvaise idée dans
le cas d'un programme qui peut tourner un temps indéterminé en
attendant des entrées : le serveur de base de données prendra lui-même
l'initiative de fermer la connexion au bout d'un certain temps si
celle-ci est inactive (<i>idle</i>) !
</p>

<p>
Il est plus sûr de recréer une connexion à chaque fois que le
programme traite une demande.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-12-04 Wed 01:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
